results/wrk2/graalvmee1/plaintextget.txt
andriy@notebook:~/Projects/com/github/plokhotnyuk/play$ ./wrk -c50 -d1m -t4 -R120000 -L -v http://localhost:9000/plaintext
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 1m test @ http://localhost:9000/plaintext
  4 threads and 50 connections
  Thread calibration: mean lat.: 1.327ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.325ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.351ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.375ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.28ms    1.09ms  24.35ms   88.45%
    Req/Sec    31.69k     3.33k   73.89k    76.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.08ms
 75.000%    1.65ms
 90.000%    2.30ms
 99.000%    5.38ms
 99.900%   12.77ms
 99.990%   17.31ms
 99.999%   21.31ms
100.000%   24.37ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.029     0.000000            1         1.00
       0.361     0.100000       601408         1.11
       0.549     0.200000      1200176         1.25
       0.727     0.300000      1798317         1.43
       0.904     0.400000      2397822         1.67
       1.082     0.500000      2998768         2.00
       1.174     0.550000      3296383         2.22
       1.274     0.600000      3596847         2.50
       1.383     0.650000      3895949         2.86
       1.506     0.700000      4195526         3.33
       1.647     0.750000      4496031         4.00
       1.726     0.775000      4645216         4.44
       1.813     0.800000      4794920         5.00
       1.910     0.825000      4944576         5.71
       2.020     0.850000      5094373         6.67
       2.147     0.875000      5244314         8.00
       2.219     0.887500      5319056         8.89
       2.299     0.900000      5393644        10.00
       2.389     0.912500      5468311        11.43
       2.493     0.925000      5544059        13.33
       2.615     0.937500      5618726        16.00
       2.687     0.943750      5656407        17.78
       2.767     0.950000      5693010        20.00
       2.865     0.956250      5731107        22.86
       2.981     0.962500      5768008        26.67
       3.133     0.968750      5805474        32.00
       3.231     0.971875      5824241        35.56
       3.351     0.975000      5842899        40.00
       3.513     0.978125      5861530        45.71
       3.747     0.981250      5880374        53.33
       4.123     0.984375      5899029        64.00
       4.395     0.985938      5908438        71.11
       4.719     0.987500      5917723        80.00
       5.115     0.989062      5927069        91.43
       5.583     0.990625      5936419       106.67
       6.127     0.992188      5945808       128.00
       6.439     0.992969      5950487       142.22
       6.799     0.993750      5955134       160.00
       7.231     0.994531      5959860       182.86
       7.723     0.995313      5964529       213.33
       8.359     0.996094      5969180       256.00
       8.751     0.996484      5971559       284.44
       9.215     0.996875      5973884       320.00
       9.751     0.997266      5976228       365.71
      10.287     0.997656      5978551       426.67
      10.863     0.998047      5980905       512.00
      11.167     0.998242      5982074       568.89
      11.527     0.998437      5983249       640.00
      11.911     0.998633      5984404       731.43
      12.343     0.998828      5985573       853.33
      12.839     0.999023      5986747      1024.00
      13.103     0.999121      5987326      1137.78
      13.383     0.999219      5987908      1280.00
      13.687     0.999316      5988496      1462.86
      13.999     0.999414      5989077      1706.67
      14.375     0.999512      5989662      2048.00
      14.599     0.999561      5989954      2275.56
      14.831     0.999609      5990247      2560.00
      15.087     0.999658      5990545      2925.71
      15.351     0.999707      5990834      3413.33
      15.639     0.999756      5991128      4096.00
      15.815     0.999780      5991273      4551.11
      16.031     0.999805      5991422      5120.00
      16.247     0.999829      5991564      5851.43
      16.559     0.999854      5991711      6826.67
      16.959     0.999878      5991865      8192.00
      17.151     0.999890      5991931      9102.22
      17.359     0.999902      5992004     10240.00
      17.647     0.999915      5992079     11702.86
      17.903     0.999927      5992151     13653.33
      18.287     0.999939      5992223     16384.00
      18.559     0.999945      5992263     18204.44
      18.767     0.999951      5992295     20480.00
      19.103     0.999957      5992331     23405.71
      19.375     0.999963      5992368     27306.67
      19.727     0.999969      5992407     32768.00
      19.839     0.999973      5992424     36408.89
      20.031     0.999976      5992442     40960.00
      20.223     0.999979      5992459     46811.43
      20.527     0.999982      5992480     54613.33
      20.735     0.999985      5992498     65536.00
      20.847     0.999986      5992505     72817.78
      21.007     0.999988      5992514     81920.00
      21.231     0.999989      5992524     93622.86
      21.503     0.999991      5992534    109226.67
      21.935     0.999992      5992542    131072.00
      22.015     0.999993      5992546    145635.56
      22.287     0.999994      5992551    163840.00
      22.543     0.999995      5992555    187245.71
      22.623     0.999995      5992560    218453.33
      23.023     0.999996      5992565    262144.00
      23.151     0.999997      5992568    291271.11
      23.199     0.999997      5992570    327680.00
      23.231     0.999997      5992571    374491.43
      23.423     0.999998      5992575    436906.67
      23.439     0.999998      5992576    524288.00
      23.471     0.999998      5992577    582542.22
      23.599     0.999998      5992579    655360.00
      23.599     0.999999      5992579    748982.86
      23.759     0.999999      5992582    873813.33
      23.759     0.999999      5992582   1048576.00
      23.759     0.999999      5992582   1165084.44
      23.855     0.999999      5992583   1310720.00
      23.855     0.999999      5992583   1497965.71
      24.079     0.999999      5992585   1747626.67
      24.079     1.000000      5992585   2097152.00
      24.079     1.000000      5992585   2330168.89
      24.079     1.000000      5992585   2621440.00
      24.079     1.000000      5992585   2995931.43
      24.319     1.000000      5992586   3495253.33
      24.319     1.000000      5992586   4194304.00
      24.319     1.000000      5992586   4660337.78
      24.319     1.000000      5992586   5242880.00
      24.319     1.000000      5992586   5991862.86
      24.367     1.000000      5992587   6990506.67
      24.367     1.000000      5992587          inf
#[Mean    =        1.285, StdDeviation   =        1.094]
#[Max     =       24.352, Total count    =      5992587]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7196372 requests in 1.00m, 2.60GB read
Requests/sec: 119943.00
Transfer/sec:     44.38MB