results/wrk2/graalvmee1/plaintextpost.txt
andriy@notebook:~/Projects/com/github/plokhotnyuk/play$ ./wrk -c50 -d1m -t4 -R65000 -L -v -s src/test/lua/plaintextPost.lua http://localhost:9000/plaintext
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 1m test @ http://localhost:9000/plaintext
  4 threads and 50 connections
  Thread calibration: mean lat.: 1.606ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.491ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.536ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.534ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.62ms    1.77ms  42.18ms   93.70%
    Req/Sec    17.15k     2.22k   29.22k    81.25%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.21ms
 75.000%    1.79ms
 90.000%    2.62ms
 99.000%   10.10ms
 99.900%   17.23ms
 99.990%   27.44ms
 99.999%   40.64ms
100.000%   42.21ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.071     0.000000            1         1.00
       0.514     0.100000       325670         1.11
       0.702     0.200000       650932         1.25
       0.870     0.300000       975755         1.43
       1.035     0.400000      1298625         1.67
       1.210     0.500000      1623694         2.00
       1.304     0.550000      1786845         2.22
       1.404     0.600000      1948227         2.50
       1.516     0.650000      2111282         2.86
       1.643     0.700000      2272978         3.33
       1.793     0.750000      2435483         4.00
       1.879     0.775000      2516001         4.44
       1.976     0.800000      2597274         5.00
       2.087     0.825000      2679228         5.71
       2.215     0.850000      2759386         6.67
       2.381     0.875000      2840672         8.00
       2.487     0.887500      2881264         8.89
       2.615     0.900000      2921840        10.00
       2.781     0.912500      2962048        11.43
       3.019     0.925000      3002821        13.33
       3.415     0.937500      3043170        16.00
       3.733     0.943750      3063446        17.78
       4.159     0.950000      3083865        20.00
       4.687     0.956250      3104048        22.86
       5.327     0.962500      3124374        26.67
       6.087     0.968750      3144621        32.00
       6.511     0.971875      3154755        35.56
       6.979     0.975000      3164932        40.00
       7.499     0.978125      3175087        45.71
       8.067     0.981250      3185218        53.33
       8.695     0.984375      3195405        64.00
       9.031     0.985938      3200401        71.11
       9.407     0.987500      3205521        80.00
       9.831     0.989062      3210547        91.43
      10.287     0.990625      3215631       106.67
      10.815     0.992188      3220717       128.00
      11.119     0.992969      3223226       142.22
      11.479     0.993750      3225760       160.00
      11.887     0.994531      3228319       182.86
      12.399     0.995313      3230853       213.33
      12.959     0.996094      3233386       256.00
      13.255     0.996484      3234632       284.44
      13.583     0.996875      3235902       320.00
      13.967     0.997266      3237185       365.71
      14.367     0.997656      3238427       426.67
      14.879     0.998047      3239701       512.00
      15.231     0.998242      3240347       568.89
      15.639     0.998437      3240968       640.00
      16.103     0.998633      3241606       731.43
      16.623     0.998828      3242242       853.33
      17.327     0.999023      3242877      1024.00
      17.743     0.999121      3243188      1137.78
      18.223     0.999219      3243501      1280.00
      18.815     0.999316      3243822      1462.86
      19.503     0.999414      3244137      1706.67
      20.287     0.999512      3244456      2048.00
      20.751     0.999561      3244610      2275.56
      21.183     0.999609      3244772      2560.00
      21.775     0.999658      3244925      2925.71
      22.351     0.999707      3245085      3413.33
      23.103     0.999756      3245243      4096.00
      23.551     0.999780      3245321      4551.11
      24.095     0.999805      3245403      5120.00
      24.895     0.999829      3245482      5851.43
      25.679     0.999854      3245560      6826.67
      26.495     0.999878      3245641      8192.00
      26.911     0.999890      3245678      9102.22
      27.583     0.999902      3245719     10240.00
      28.767     0.999915      3245757     11702.86
      30.607     0.999927      3245797     13653.33
      32.415     0.999939      3245836     16384.00
      33.503     0.999945      3245857     18204.44
      34.751     0.999951      3245876     20480.00
      36.191     0.999957      3245896     23405.71
      37.279     0.999963      3245917     27306.67
      38.047     0.999969      3245936     32768.00
      38.335     0.999973      3245946     36408.89
      38.687     0.999976      3245955     40960.00
      39.231     0.999979      3245965     46811.43
      39.519     0.999982      3245976     54613.33
      39.871     0.999985      3245985     65536.00
      40.063     0.999986      3245990     72817.78
      40.287     0.999988      3245995     81920.00
      40.511     0.999989      3246000     93622.86
      40.863     0.999991      3246005    109226.67
      41.087     0.999992      3246010    131072.00
      41.183     0.999993      3246012    145635.56
      41.279     0.999994      3246015    163840.00
      41.375     0.999995      3246017    187245.71
      41.471     0.999995      3246020    218453.33
      41.503     0.999996      3246022    262144.00
      41.567     0.999997      3246023    291271.11
      41.759     0.999997      3246025    327680.00
      41.823     0.999997      3246028    374491.43
      41.823     0.999998      3246028    436906.67
      41.823     0.999998      3246028    524288.00
      41.855     0.999998      3246029    582542.22
      41.887     0.999998      3246031    655360.00
      41.887     0.999999      3246031    748982.86
      41.887     0.999999      3246031    873813.33
      41.887     0.999999      3246031   1048576.00
      42.143     0.999999      3246032   1165084.44
      42.143     0.999999      3246032   1310720.00
      42.143     0.999999      3246032   1497965.71
      42.207     0.999999      3246034   1747626.67
      42.207     1.000000      3246034          inf
#[Mean    =        1.621, StdDeviation   =        1.772]
#[Max     =       42.176, Total count    =      3246034]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3898075 requests in 1.00m, 1.41GB read
Requests/sec:  64967.70
Transfer/sec:     24.04MB